In [1]:
import pandas as pd
import numpy  as np
import seaborn as sns

In [2]:
titanic= sns.load_dataset('titanic')
df = titanic.copy()
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [3]:
#vraag1
df.describe()
#fare std nin yuksek olmasi degerlerin daginik oldugunu gosteriyor
#

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
#vraag2_1
from pandas.api.types import CategoricalDtype
df.sex=df.sex.astype(CategoricalDtype(ordered=False))
df.alive=df.alive.astype(CategoricalDtype(ordered=False))
df.who=df.who.astype(CategoricalDtype(ordered=False))
df.embark_town=df.embark_town.astype(CategoricalDtype(ordered=False))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    category
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    category
 13  alive        891 non-null    category
 14  alone        891 non-null    bool
dtypes: bool(2), category(6), float64(2), int64(4), object(1)
memory usage: 56.8+ KB

In [6]:
df.sex.value_counts()
df.who.value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [7]:
#vraag2_2
df.sex=df.sex.astype(CategoricalDtype(ordered=True))
df.who=df.who.astype(CategoricalDtype(ordered=True))
df.sex.head()
df.who.head()

0      man
1    woman
2    woman
3    woman
4      man
Name: who, dtype: category
Categories (3, object): ['child' < 'man' < 'woman']

In [9]:
dumm=pd.get_dummies(df.sex)
dumm

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [11]:
dumm=pd.get_dummies(df.pclass)
dumm

     1  2  3
0    0  0  1
1    1  0  0
2    0  0  1
3    1  0  0
4    0  0  1
..  .. .. ..
886  0  1  0
887  1  0  0
888  0  0  1
889  1  0  0
890  0  0  1

[891 rows x 3 columns]

In [38]:
from scipy.stats import norm
norm.cdf(70,80,5)

0.022750131948179195

In [42]:
df.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [43]:
df.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [44]:
df.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [50]:
x=np.array([491,216,184])#siniflar
y=np.array([549,342])

In [49]:
import scipy.stats as stats
stats.describe(x)

DescribeResult(nobs=3, minmax=(184, 491), mean=297.0, variance=28483.0, skewness=0.678615048567598, kurtosis=-1.5000000000000004)

In [51]:
stats.describe(y)

DescribeResult(nobs=2, minmax=(342, 549), mean=445.5, variance=21424.5, skewness=0.0, kurtosis=-2.0)